trapped-dot-com/ArduinoCore-samd/boards.txt
# Menu: USB Stack
adafruit_feather_m0_express.menu.usbstack.arduino=Arduino
adafruit_feather_m0_express.menu.usbstack.tinyusb=TinyUSB
adafruit_feather_m0_express.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
adafruit_feather_m0_express.menu.debug.off=Off
adafruit_feather_m0_express.menu.debug.on=On
adafruit_feather_m0_express.menu.debug.on.build.flags.debug=-g

# Menu: Debugger
adafruit_feather_m0_express.menu.debugger.daplink=CMSIS-DAP (DAPLink)
adafruit_feather_m0_express.menu.debugger.daplink.build.openocdscript=scripts/openocd/daplink_samd21.cfg
adafruit_feather_m0_express.menu.debugger.jlink=J-Link
adafruit_feather_m0_express.menu.debugger.jlink.build.openocdscript=scripts/openocd/jlink_samd21.cfg

# -----------------------------------
# Adafruit Metro M0 Express (SAMD21)
# -----------------------------------
adafruit_metro_m0.name=Adafruit Metro M0 Express (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_metro_m0.vid.0=0x239A
adafruit_metro_m0.pid.0=0x8013
adafruit_metro_m0.vid.1=0x239A
adafruit_metro_m0.pid.1=0x0013

# Upload
adafruit_metro_m0.upload.tool=bossac18
adafruit_metro_m0.upload.protocol=sam-ba
adafruit_metro_m0.upload.maximum_size=262144
adafruit_metro_m0.upload.offset=0x2000
adafruit_metro_m0.upload.use_1200bps_touch=true
adafruit_metro_m0.upload.wait_for_upload_port=true
adafruit_metro_m0.upload.native_usb=true

# Build
adafruit_metro_m0.build.mcu=cortex-m0plus
adafruit_metro_m0.build.f_cpu=48000000L
adafruit_metro_m0.build.usb_product="Metro M0 Express"
adafruit_metro_m0.build.usb_manufacturer="Adafruit"
adafruit_metro_m0.build.board=SAMD_ZERO
adafruit_metro_m0.build.core=arduino
adafruit_metro_m0.build.extra_flags=-D__SAMD21G18A__ -DADAFRUIT_METRO_M0_EXPRESS -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_metro_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_metro_m0.build.variant=metro_m0
adafruit_metro_m0.build.variant_system_lib=
adafruit_metro_m0.build.vid=0x239A
adafruit_metro_m0.build.pid=0x8013
adafruit_metro_m0.bootloader.tool=openocd
adafruit_metro_m0.bootloader.file=metroM0/bootloader-metro_m0-v2.0.0-adafruit.5.bin

# Menu: Optimization
adafruit_metro_m0.menu.opt.small=Small (-Os) (standard)
adafruit_metro_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_metro_m0.menu.opt.fast=Fast (-O2)
adafruit_metro_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_metro_m0.menu.opt.faster=Faster (-O3)
adafruit_metro_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_metro_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_metro_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_metro_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_metro_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

# Menu: USB Stack
adafruit_metro_m0.menu.usbstack.arduino=Arduino
adafruit_metro_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_metro_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
adafruit_metro_m0.menu.debug.off=Off
adafruit_metro_m0.menu.debug.on=On
adafruit_metro_m0.menu.debug.on.build.flags.debug=-g

# Menu: Debugger
adafruit_metro_m0.menu.debugger.daplink=CMSIS-DAP (DAPLink)
adafruit_metro_m0.menu.debugger.daplink.build.openocdscript=scripts/openocd/daplink_samd21.cfg
adafruit_metro_m0.menu.debugger.jlink=J-Link
adafruit_metro_m0.menu.debugger.jlink.build.openocdscript=scripts/openocd/jlink_samd21.cfg

# -----------------------------------
# Adafruit Circuit Playground Express (SAMD21)
# -----------------------------------
adafruit_circuitplayground_m0.name=Adafruit Circuit Playground Express (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_circuitplayground_m0.vid.0=0x239A
adafruit_circuitplayground_m0.pid.0=0x8018
adafruit_circuitplayground_m0.vid.1=0x239A
adafruit_circuitplayground_m0.pid.1=0x0019

# Upload
adafruit_circuitplayground_m0.upload.tool=bossac18
adafruit_circuitplayground_m0.upload.protocol=sam-ba
adafruit_circuitplayground_m0.upload.maximum_size=262144
adafruit_circuitplayground_m0.upload.offset=0x2000
adafruit_circuitplayground_m0.upload.use_1200bps_touch=true
adafruit_circuitplayground_m0.upload.wait_for_upload_port=true
adafruit_circuitplayground_m0.upload.native_usb=true

# Build
adafruit_circuitplayground_m0.build.mcu=cortex-m0plus
adafruit_circuitplayground_m0.build.f_cpu=48000000L
adafruit_circuitplayground_m0.build.usb_product="Circuit Playground Express"
adafruit_circuitplayground_m0.build.usb_manufacturer="Adafruit"
adafruit_circuitplayground_m0.build.board=SAMD_CIRCUITPLAYGROUND_EXPRESS
adafruit_circuitplayground_m0.build.core=arduino
adafruit_circuitplayground_m0.build.extra_flags=-D__SAMD21G18A__ -DCRYSTALLESS -DADAFRUIT_CIRCUITPLAYGROUND_M0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_circuitplayground_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_circuitplayground_m0.build.variant=circuitplay
adafruit_circuitplayground_m0.build.variant_system_lib=
adafruit_circuitplayground_m0.build.vid=0x239A
adafruit_circuitplayground_m0.build.pid=0x8018
adafruit_circuitplayground_m0.bootloader.tool=openocd
adafruit_circuitplayground_m0.bootloader.file=circuitplayM0/bootloader-circuitplay_m0-v2.0.0-adafruit.5.bin

# Menu: Optimization
adafruit_circuitplayground_m0.menu.opt.small=Small (-Os) (standard)
adafruit_circuitplayground_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_circuitplayground_m0.menu.opt.fast=Fast (-O2)
adafruit_circuitplayground_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_circuitplayground_m0.menu.opt.faster=Faster (-O3)
adafruit_circuitplayground_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_circuitplayground_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_circuitplayground_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_circuitplayground_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_circuitplayground_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

# Menu: USB Stack
adafruit_circuitplayground_m0.menu.usbstack.arduino=Arduino
adafruit_circuitplayground_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_circuitplayground_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
adafruit_circuitplayground_m0.menu.debug.off=Off
adafruit_circuitplayground_m0.menu.debug.on=On
adafruit_circuitplayground_m0.menu.debug.on.build.flags.debug=-g

