trapped-dot-com/ArduinoCore-samd/boards.txt
# Menu: Debugger
adafruit_circuitplayground_m0.menu.debugger.daplink=CMSIS-DAP (DAPLink)
adafruit_circuitplayground_m0.menu.debugger.daplink.build.openocdscript=scripts/openocd/daplink_samd21.cfg
adafruit_circuitplayground_m0.menu.debugger.jlink=J-Link
adafruit_circuitplayground_m0.menu.debugger.jlink.build.openocdscript=scripts/openocd/jlink_samd21.cfg

# -----------------------------------
# Adafruit Gemma M0 (SAMD21)
# -----------------------------------
adafruit_gemma_m0.name=Adafruit Gemma M0 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_gemma_m0.vid.0=0x239A
adafruit_gemma_m0.pid.0=0x801C
adafruit_gemma_m0.vid.1=0x239A
adafruit_gemma_m0.pid.1=0x001C

# Upload
adafruit_gemma_m0.upload.tool=bossac18
adafruit_gemma_m0.upload.protocol=sam-ba
adafruit_gemma_m0.upload.maximum_size=262144
adafruit_gemma_m0.upload.offset=0x2000
adafruit_gemma_m0.upload.use_1200bps_touch=true
adafruit_gemma_m0.upload.wait_for_upload_port=true
adafruit_gemma_m0.upload.native_usb=true

# Build
adafruit_gemma_m0.build.mcu=cortex-m0plus
adafruit_gemma_m0.build.f_cpu=48000000L
adafruit_gemma_m0.build.usb_product="Gemma M0"
adafruit_gemma_m0.build.usb_manufacturer="Adafruit"
adafruit_gemma_m0.build.board=GEMMA_M0
adafruit_gemma_m0.build.core=arduino
adafruit_gemma_m0.build.extra_flags=-D__SAMD21E18A__ -DCRYSTALLESS -DADAFRUIT_GEMMA_M0 -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_gemma_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_gemma_m0.build.variant=gemma_m0
adafruit_gemma_m0.build.variant_system_lib=
adafruit_gemma_m0.build.vid=0x239A
adafruit_gemma_m0.build.pid=0x801C
adafruit_gemma_m0.bootloader.tool=openocd
adafruit_gemma_m0.bootloader.file=gemmaM0/bootloader-gemma_m0-v2.0.0-adafruit.5.bin

# Menu: Optimization
adafruit_gemma_m0.menu.opt.small=Small (-Os) (standard)
adafruit_gemma_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_gemma_m0.menu.opt.fast=Fast (-O2)
adafruit_gemma_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_gemma_m0.menu.opt.faster=Faster (-O3)
adafruit_gemma_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_gemma_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_gemma_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_gemma_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_gemma_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

# Menu: USB Stack
adafruit_gemma_m0.menu.usbstack.arduino=Arduino
adafruit_gemma_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_gemma_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
adafruit_gemma_m0.menu.debug.off=Off
adafruit_gemma_m0.menu.debug.on=On
adafruit_gemma_m0.menu.debug.on.build.flags.debug=-g

# Menu: Debugger
adafruit_gemma_m0.menu.debugger.daplink=CMSIS-DAP (DAPLink)
adafruit_gemma_m0.menu.debugger.daplink.build.openocdscript=scripts/openocd/daplink_samd21.cfg
adafruit_gemma_m0.menu.debugger.jlink=J-Link
adafruit_gemma_m0.menu.debugger.jlink.build.openocdscript=scripts/openocd/jlink_samd21.cfg

# -----------------------------------
# Adafruit Trinket M0 (SAMD21)
# -----------------------------------
adafruit_trinket_m0.name=Adafruit Trinket M0 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_trinket_m0.vid.0=0x239A
adafruit_trinket_m0.pid.0=0x801E
adafruit_trinket_m0.vid.1=0x239A
adafruit_trinket_m0.pid.1=0x001E

# Upload
adafruit_trinket_m0.upload.tool=bossac18
adafruit_trinket_m0.upload.protocol=sam-ba
adafruit_trinket_m0.upload.maximum_size=262144
adafruit_trinket_m0.upload.offset=0x2000
adafruit_trinket_m0.upload.use_1200bps_touch=true
adafruit_trinket_m0.upload.wait_for_upload_port=true
adafruit_trinket_m0.upload.native_usb=true

# Build
adafruit_trinket_m0.build.mcu=cortex-m0plus
adafruit_trinket_m0.build.f_cpu=48000000L
adafruit_trinket_m0.build.usb_product="Trinket M0"
adafruit_trinket_m0.build.usb_manufacturer="Adafruit"
adafruit_trinket_m0.build.board=TRINKET_M0
adafruit_trinket_m0.build.core=arduino
adafruit_trinket_m0.build.extra_flags=-D__SAMD21E18A__ -DCRYSTALLESS -DADAFRUIT_TRINKET_M0 -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_trinket_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_trinket_m0.build.variant=trinket_m0
adafruit_trinket_m0.build.variant_system_lib=
adafruit_trinket_m0.build.vid=0x239A
adafruit_trinket_m0.build.pid=0x801E
adafruit_trinket_m0.bootloader.tool=openocd
adafruit_trinket_m0.bootloader.file=trinketm0/bootloader-trinket_m0-v2.0.0-adafruit.5.bin

# Menu: Optimization
adafruit_trinket_m0.menu.opt.small=Small (-Os) (standard)
adafruit_trinket_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_trinket_m0.menu.opt.fast=Fast (-O2)
adafruit_trinket_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_trinket_m0.menu.opt.faster=Faster (-O3)
adafruit_trinket_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_trinket_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_trinket_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_trinket_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_trinket_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

# Menu: USB Stack
adafruit_trinket_m0.menu.usbstack.arduino=Arduino
adafruit_trinket_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_trinket_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
adafruit_trinket_m0.menu.debug.off=Off
adafruit_trinket_m0.menu.debug.on=On
adafruit_trinket_m0.menu.debug.on.build.flags.debug=-g

# Menu: Debugger
adafruit_trinket_m0.menu.debugger.daplink=CMSIS-DAP (DAPLink)
adafruit_trinket_m0.menu.debugger.daplink.build.openocdscript=scripts/openocd/daplink_samd21.cfg
adafruit_trinket_m0.menu.debugger.jlink=J-Link
adafruit_trinket_m0.menu.debugger.jlink.build.openocdscript=scripts/openocd/jlink_samd21.cfg

# -----------------------------------
# Adafruit QT Py M0 (SAMD21)
# -----------------------------------
adafruit_qtpy_m0.name=Adafruit QT Py M0 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_qtpy_m0.vid.0=0x239A
adafruit_qtpy_m0.pid.0=0x80CB
adafruit_qtpy_m0.vid.1=0x239A
adafruit_qtpy_m0.pid.1=0x00CB
adafruit_qtpy_m0.vid.2=0x239A
adafruit_qtpy_m0.pid.2=0x00CC

# Upload
adafruit_qtpy_m0.upload.tool=bossac18
adafruit_qtpy_m0.upload.protocol=sam-ba
adafruit_qtpy_m0.upload.maximum_size=262144
adafruit_qtpy_m0.upload.offset=0x2000
adafruit_qtpy_m0.upload.use_1200bps_touch=true
adafruit_qtpy_m0.upload.wait_for_upload_port=true
adafruit_qtpy_m0.upload.native_usb=true

# Build
adafruit_qtpy_m0.build.mcu=cortex-m0plus
adafruit_qtpy_m0.build.f_cpu=48000000L
adafruit_qtpy_m0.build.usb_product="QT Py M0"
adafruit_qtpy_m0.build.usb_manufacturer="Adafruit"
adafruit_qtpy_m0.build.board=QTPY_M0
adafruit_qtpy_m0.build.core=arduino
adafruit_qtpy_m0.build.extra_flags=-D__SAMD21E18A__ -DCRYSTALLESS -DADAFRUIT_QTPY_M0 -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_qtpy_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_qtpy_m0.build.variant=qtpy_m0
adafruit_qtpy_m0.build.variant_system_lib=
adafruit_qtpy_m0.build.vid=0x239A
adafruit_qtpy_m0.build.pid=0x80CB
adafruit_qtpy_m0.bootloader.tool=openocd
adafruit_qtpy_m0.bootloader.file=qtpyM0/bootloader-qtpy_m0.bin

# Menu: Optimization
adafruit_qtpy_m0.menu.opt.small=Small (-Os) (standard)
adafruit_qtpy_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_qtpy_m0.menu.opt.fast=Fast (-O2)
adafruit_qtpy_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_qtpy_m0.menu.opt.faster=Faster (-O3)
adafruit_qtpy_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_qtpy_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_qtpy_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_qtpy_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_qtpy_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

