trapped-dot-com/ArduinoCore-samd/boards.txt
# Menu: USB Stack
adafruit_qtpy_m0.menu.usbstack.arduino=Arduino
adafruit_qtpy_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_qtpy_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
adafruit_qtpy_m0.menu.debug.off=Off
adafruit_qtpy_m0.menu.debug.on=On
adafruit_qtpy_m0.menu.debug.on.build.flags.debug=-g

# Menu: Debugger
adafruit_qtpy_m0.menu.debugger.daplink=CMSIS-DAP (DAPLink)
adafruit_qtpy_m0.menu.debugger.daplink.build.openocdscript=scripts/openocd/daplink_samd21.cfg
adafruit_qtpy_m0.menu.debugger.jlink=J-Link
adafruit_qtpy_m0.menu.debugger.jlink.build.openocdscript=scripts/openocd/jlink_samd21.cfg

# -----------------------------------
# Adafruit NeoPixel Trinkey M0 (SAMD21)
# -----------------------------------
adafruit_neotrinkey_m0.name=Adafruit NeoPixel Trinkey M0 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_neotrinkey_m0.vid.0=0x239A
adafruit_neotrinkey_m0.pid.0=0x80EF
adafruit_neotrinkey_m0.vid.1=0x239A
adafruit_neotrinkey_m0.pid.1=0x00EF
adafruit_neotrinkey_m0.vid.2=0x239A
adafruit_neotrinkey_m0.pid.2=0x80F0

# Upload
adafruit_neotrinkey_m0.upload.tool=bossac18
adafruit_neotrinkey_m0.upload.protocol=sam-ba
adafruit_neotrinkey_m0.upload.maximum_size=262144
adafruit_neotrinkey_m0.upload.offset=0x2000
adafruit_neotrinkey_m0.upload.use_1200bps_touch=true
adafruit_neotrinkey_m0.upload.wait_for_upload_port=true
adafruit_neotrinkey_m0.upload.native_usb=true

# Build
adafruit_neotrinkey_m0.build.mcu=cortex-m0plus
adafruit_neotrinkey_m0.build.f_cpu=48000000L
adafruit_neotrinkey_m0.build.usb_product="NeoPixel Trinkey M0"
adafruit_neotrinkey_m0.build.usb_manufacturer="Adafruit"
adafruit_neotrinkey_m0.build.board=NEOTRINKEY_M0
adafruit_neotrinkey_m0.build.core=arduino
adafruit_neotrinkey_m0.build.extra_flags=-D__SAMD21E18A__ -DCRYSTALLESS -DADAFRUIT_NEOTRINKEY_M0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_neotrinkey_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_neotrinkey_m0.build.variant=neotrinkey_m0
adafruit_neotrinkey_m0.build.variant_system_lib=
adafruit_neotrinkey_m0.build.vid=0x239A
adafruit_neotrinkey_m0.build.pid=0x80EF
adafruit_neotrinkey_m0.bootloader.tool=openocd
adafruit_neotrinkey_m0.bootloader.file=neotrinkey_m0/bootloader-neotrinkey_m0.bin

# Menu: Optimization
adafruit_neotrinkey_m0.menu.opt.small=Small (-Os) (standard)
adafruit_neotrinkey_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_neotrinkey_m0.menu.opt.fast=Fast (-O2)
adafruit_neotrinkey_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_neotrinkey_m0.menu.opt.faster=Faster (-O3)
adafruit_neotrinkey_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_neotrinkey_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_neotrinkey_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_neotrinkey_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_neotrinkey_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

# Menu: USB Stack
adafruit_neotrinkey_m0.menu.usbstack.arduino=Arduino
adafruit_neotrinkey_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_neotrinkey_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
adafruit_neotrinkey_m0.menu.debug.off=Off
adafruit_neotrinkey_m0.menu.debug.on=On
adafruit_neotrinkey_m0.menu.debug.on.build.flags.debug=-g

# Menu: Debugger
adafruit_neotrinkey_m0.menu.debugger.daplink=CMSIS-DAP (DAPLink)
adafruit_neotrinkey_m0.menu.debugger.daplink.build.openocdscript=scripts/openocd/daplink_samd21.cfg
adafruit_neotrinkey_m0.menu.debugger.jlink=J-Link
adafruit_neotrinkey_m0.menu.debugger.jlink.build.openocdscript=scripts/openocd/jlink_samd21.cfg

# -----------------------------------
# Adafruit Rotary Trinkey M0 (SAMD21)
# -----------------------------------
adafruit_rotarytrinkey_m0.name=Adafruit Rotary Trinkey M0 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_rotarytrinkey_m0.vid.0=0x239A
adafruit_rotarytrinkey_m0.pid.0=0x80FB
adafruit_rotarytrinkey_m0.vid.1=0x239A
adafruit_rotarytrinkey_m0.pid.1=0x00FB
adafruit_rotarytrinkey_m0.vid.2=0x239A
adafruit_rotarytrinkey_m0.pid.2=0x80FC

# Upload
adafruit_rotarytrinkey_m0.upload.tool=bossac18
adafruit_rotarytrinkey_m0.upload.protocol=sam-ba
adafruit_rotarytrinkey_m0.upload.maximum_size=262144
adafruit_rotarytrinkey_m0.upload.offset=0x2000
adafruit_rotarytrinkey_m0.upload.use_1200bps_touch=true
adafruit_rotarytrinkey_m0.upload.wait_for_upload_port=true
adafruit_rotarytrinkey_m0.upload.native_usb=true

# Build
adafruit_rotarytrinkey_m0.build.mcu=cortex-m0plus
adafruit_rotarytrinkey_m0.build.f_cpu=48000000L
adafruit_rotarytrinkey_m0.build.usb_product="Rotary Trinkey M0"
adafruit_rotarytrinkey_m0.build.usb_manufacturer="Adafruit"
adafruit_rotarytrinkey_m0.build.board=ROTARYTRINKEY_M0
adafruit_rotarytrinkey_m0.build.core=arduino
adafruit_rotarytrinkey_m0.build.extra_flags=-D__SAMD21E18A__ -DCRYSTALLESS -DADAFRUIT_ROTARYTRINKEY_M0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_rotarytrinkey_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_rotarytrinkey_m0.build.variant=rotarytrinkey_m0
adafruit_rotarytrinkey_m0.build.variant_system_lib=
adafruit_rotarytrinkey_m0.build.vid=0x239A
adafruit_rotarytrinkey_m0.build.pid=0x80FB
adafruit_rotarytrinkey_m0.bootloader.tool=openocd
adafruit_rotarytrinkey_m0.bootloader.file=rotarytrinkey_m0/bootloader-rotarytrinkey_m0.bin

# Menu: Optimization
adafruit_rotarytrinkey_m0.menu.opt.small=Small (-Os) (standard)
adafruit_rotarytrinkey_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_rotarytrinkey_m0.menu.opt.fast=Fast (-O2)
adafruit_rotarytrinkey_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_rotarytrinkey_m0.menu.opt.faster=Faster (-O3)
adafruit_rotarytrinkey_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_rotarytrinkey_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_rotarytrinkey_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_rotarytrinkey_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_rotarytrinkey_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

