trapped-dot-com/ArduinoCore-samd/boards.txt
# Menu: USB Stack
adafruit_rotarytrinkey_m0.menu.usbstack.arduino=Arduino
adafruit_rotarytrinkey_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_rotarytrinkey_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
adafruit_rotarytrinkey_m0.menu.debug.off=Off
adafruit_rotarytrinkey_m0.menu.debug.on=On
adafruit_rotarytrinkey_m0.menu.debug.on.build.flags.debug=-g

# Menu: Debugger
adafruit_rotarytrinkey_m0.menu.debugger.daplink=CMSIS-DAP (DAPLink)
adafruit_rotarytrinkey_m0.menu.debugger.daplink.build.openocdscript=scripts/openocd/daplink_samd21.cfg
adafruit_rotarytrinkey_m0.menu.debugger.jlink=J-Link
adafruit_rotarytrinkey_m0.menu.debugger.jlink.build.openocdscript=scripts/openocd/jlink_samd21.cfg

# -----------------------------------
# Adafruit NeoKey Trinkey M0 (SAMD21)
# -----------------------------------
adafruit_neokeytrinkey_m0.name=Adafruit NeoKey Trinkey M0 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_neokeytrinkey_m0.vid.0=0x239A
adafruit_neokeytrinkey_m0.pid.0=0x80FF
adafruit_neokeytrinkey_m0.vid.1=0x239A
adafruit_neokeytrinkey_m0.pid.1=0x00FF
adafruit_neokeytrinkey_m0.vid.2=0x239A
adafruit_neokeytrinkey_m0.pid.2=0x8100

# Upload
adafruit_neokeytrinkey_m0.upload.tool=bossac18
adafruit_neokeytrinkey_m0.upload.protocol=sam-ba
adafruit_neokeytrinkey_m0.upload.maximum_size=262144
adafruit_neokeytrinkey_m0.upload.offset=0x2000
adafruit_neokeytrinkey_m0.upload.use_1200bps_touch=true
adafruit_neokeytrinkey_m0.upload.wait_for_upload_port=true
adafruit_neokeytrinkey_m0.upload.native_usb=true

# Build
adafruit_neokeytrinkey_m0.build.mcu=cortex-m0plus
adafruit_neokeytrinkey_m0.build.f_cpu=48000000L
adafruit_neokeytrinkey_m0.build.usb_product="NeoKey Trinkey M0"
adafruit_neokeytrinkey_m0.build.usb_manufacturer="Adafruit"
adafruit_neokeytrinkey_m0.build.board=NEOKEYTRINKEY_M0
adafruit_neokeytrinkey_m0.build.core=arduino
adafruit_neokeytrinkey_m0.build.extra_flags=-D__SAMD21E18A__ -DCRYSTALLESS -DADAFRUIT_NEOKEYTRINKEY_M0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_neokeytrinkey_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_neokeytrinkey_m0.build.variant=neokeytrinkey_m0
adafruit_neokeytrinkey_m0.build.variant_system_lib=
adafruit_neokeytrinkey_m0.build.vid=0x239A
adafruit_neokeytrinkey_m0.build.pid=0x80FF
adafruit_neokeytrinkey_m0.bootloader.tool=openocd
adafruit_neokeytrinkey_m0.bootloader.file=neokeytrinkey_m0/bootloader-neokeytrinkey_m0.bin

# Menu: Optimization
adafruit_neokeytrinkey_m0.menu.opt.small=Small (-Os) (standard)
adafruit_neokeytrinkey_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_neokeytrinkey_m0.menu.opt.fast=Fast (-O2)
adafruit_neokeytrinkey_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_neokeytrinkey_m0.menu.opt.faster=Faster (-O3)
adafruit_neokeytrinkey_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_neokeytrinkey_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_neokeytrinkey_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_neokeytrinkey_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_neokeytrinkey_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

# Menu: USB Stack
adafruit_neokeytrinkey_m0.menu.usbstack.arduino=Arduino
adafruit_neokeytrinkey_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_neokeytrinkey_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
adafruit_neokeytrinkey_m0.menu.debug.off=Off
adafruit_neokeytrinkey_m0.menu.debug.on=On
adafruit_neokeytrinkey_m0.menu.debug.on.build.flags.debug=-g

# Menu: Debugger
adafruit_neokeytrinkey_m0.menu.debugger.daplink=CMSIS-DAP (DAPLink)
adafruit_neokeytrinkey_m0.menu.debugger.daplink.build.openocdscript=scripts/openocd/daplink_samd21.cfg
adafruit_neokeytrinkey_m0.menu.debugger.jlink=J-Link
adafruit_neokeytrinkey_m0.menu.debugger.jlink.build.openocdscript=scripts/openocd/jlink_samd21.cfg

# -----------------------------------
# Adafruit Slide Trinkey M0 (SAMD21)
# -----------------------------------
adafruit_slidetrinkey_m0.name=Adafruit Slide Trinkey M0 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_slidetrinkey_m0.vid.0=0x239A
adafruit_slidetrinkey_m0.pid.0=0x8101
adafruit_slidetrinkey_m0.vid.1=0x239A
adafruit_slidetrinkey_m0.pid.1=0x0101
adafruit_slidetrinkey_m0.vid.2=0x239A
adafruit_slidetrinkey_m0.pid.2=0x8102

# Upload
adafruit_slidetrinkey_m0.upload.tool=bossac18
adafruit_slidetrinkey_m0.upload.protocol=sam-ba
adafruit_slidetrinkey_m0.upload.maximum_size=262144
adafruit_slidetrinkey_m0.upload.offset=0x2000
adafruit_slidetrinkey_m0.upload.use_1200bps_touch=true
adafruit_slidetrinkey_m0.upload.wait_for_upload_port=true
adafruit_slidetrinkey_m0.upload.native_usb=true

# Build
adafruit_slidetrinkey_m0.build.mcu=cortex-m0plus
adafruit_slidetrinkey_m0.build.f_cpu=48000000L
adafruit_slidetrinkey_m0.build.usb_product="Slide Trinkey M0"
adafruit_slidetrinkey_m0.build.usb_manufacturer="Adafruit"
adafruit_slidetrinkey_m0.build.board=SLIDETRINKEY_M0
adafruit_slidetrinkey_m0.build.core=arduino
adafruit_slidetrinkey_m0.build.extra_flags=-D__SAMD21E18A__ -DCRYSTALLESS -DADAFRUIT_SLIDETRINKEY_M0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_slidetrinkey_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_slidetrinkey_m0.build.variant=slidetrinkey_m0
adafruit_slidetrinkey_m0.build.variant_system_lib=
adafruit_slidetrinkey_m0.build.vid=0x239A
adafruit_slidetrinkey_m0.build.pid=0x8101
adafruit_slidetrinkey_m0.bootloader.tool=openocd
adafruit_slidetrinkey_m0.bootloader.file=slidetrinkey_m0/bootloader-slidetrinkey_m0.bin

# Menu: Optimization
adafruit_slidetrinkey_m0.menu.opt.small=Small (-Os) (standard)
adafruit_slidetrinkey_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_slidetrinkey_m0.menu.opt.fast=Fast (-O2)
adafruit_slidetrinkey_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_slidetrinkey_m0.menu.opt.faster=Faster (-O3)
adafruit_slidetrinkey_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_slidetrinkey_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_slidetrinkey_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_slidetrinkey_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_slidetrinkey_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

