trapped-dot-com/ArduinoCore-samd/boards.txt
# Menu: USB Stack
adafruit_itsybitsy_m0.menu.usbstack.arduino=Arduino
adafruit_itsybitsy_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_itsybitsy_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
adafruit_itsybitsy_m0.menu.debug.off=Off
adafruit_itsybitsy_m0.menu.debug.on=On
adafruit_itsybitsy_m0.menu.debug.on.build.flags.debug=-g

# Menu: Debugger
adafruit_itsybitsy_m0.menu.debugger.daplink=CMSIS-DAP (DAPLink)
adafruit_itsybitsy_m0.menu.debugger.daplink.build.openocdscript=scripts/openocd/daplink_samd21.cfg
adafruit_itsybitsy_m0.menu.debugger.jlink=J-Link
adafruit_itsybitsy_m0.menu.debugger.jlink.build.openocdscript=scripts/openocd/jlink_samd21.cfg

# -----------------------------------
# Adafruit pIRKey (SAMD21)
# -----------------------------------
adafruit_pirkey.name=Adafruit pIRKey (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_pirkey.vid.0=0x239A
adafruit_pirkey.pid.0=0x8027
adafruit_pirkey.vid.1=0x239A
adafruit_pirkey.pid.1=0x0027
adafruit_pirkey.vid.2=0x239A
adafruit_pirkey.pid.2=0x8028

# Upload
adafruit_pirkey.upload.tool=bossac18
adafruit_pirkey.upload.protocol=sam-ba
adafruit_pirkey.upload.maximum_size=262144
adafruit_pirkey.upload.offset=0x2000
adafruit_pirkey.upload.use_1200bps_touch=true
adafruit_pirkey.upload.wait_for_upload_port=true
adafruit_pirkey.upload.native_usb=true

# Build
adafruit_pirkey.build.mcu=cortex-m0plus
adafruit_pirkey.build.f_cpu=48000000L
adafruit_pirkey.build.usb_product="pIRKey"
adafruit_pirkey.build.usb_manufacturer="Adafruit"
adafruit_pirkey.build.board=PIRKEY
adafruit_pirkey.build.core=arduino
adafruit_pirkey.build.extra_flags=-D__SAMD21E18A__ -DCRYSTALLESS -DADAFRUIT_PIRKEY -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_pirkey.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_pirkey.build.variant=pirkey
adafruit_pirkey.build.variant_system_lib=
adafruit_pirkey.build.vid=0x239A
adafruit_pirkey.build.pid=0x8027
adafruit_pirkey.bootloader.tool=openocd
adafruit_pirkey.bootloader.file=pirkey/bootloader-pirkey-v2.0.0-adafruit.5.bin

# Menu: Optimization
adafruit_pirkey.menu.opt.small=Small (-Os) (standard)
adafruit_pirkey.menu.opt.small.build.flags.optimize=-Os
adafruit_pirkey.menu.opt.fast=Fast (-O2)
adafruit_pirkey.menu.opt.fast.build.flags.optimize=-O2
adafruit_pirkey.menu.opt.faster=Faster (-O3)
adafruit_pirkey.menu.opt.faster.build.flags.optimize=-O3
adafruit_pirkey.menu.opt.fastest=Fastest (-Ofast)
adafruit_pirkey.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_pirkey.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_pirkey.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

# Menu: USB Stack
adafruit_pirkey.menu.usbstack.arduino=Arduino
adafruit_pirkey.menu.usbstack.tinyusb=TinyUSB
adafruit_pirkey.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
adafruit_pirkey.menu.debug.off=Off
adafruit_pirkey.menu.debug.on=On
adafruit_pirkey.menu.debug.on.build.flags.debug=-g

# Menu: Debugger
adafruit_pirkey.menu.debugger.daplink=CMSIS-DAP (DAPLink)
adafruit_pirkey.menu.debugger.daplink.build.openocdscript=scripts/openocd/daplink_samd21.cfg
adafruit_pirkey.menu.debugger.jlink=J-Link
adafruit_pirkey.menu.debugger.jlink.build.openocdscript=scripts/openocd/jlink_samd21.cfg

# -----------------------------------
# Adafruit Hallowing M0 (SAMD21)
# -----------------------------------
adafruit_hallowing.name=Adafruit Hallowing M0 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_hallowing.vid.0=0x239A
adafruit_hallowing.pid.0=0xDEAD
adafruit_hallowing.vid.1=0x239A
adafruit_hallowing.pid.1=0xD1ED
adafruit_hallowing.vid.2=0x239A
adafruit_hallowing.pid.2=0xB000

# Upload
adafruit_hallowing.upload.tool=bossac18
adafruit_hallowing.upload.protocol=sam-ba
adafruit_hallowing.upload.maximum_size=262144
adafruit_hallowing.upload.offset=0x2000
adafruit_hallowing.upload.use_1200bps_touch=true
adafruit_hallowing.upload.wait_for_upload_port=true
adafruit_hallowing.upload.native_usb=true

# Build
adafruit_hallowing.build.mcu=cortex-m0plus
adafruit_hallowing.build.f_cpu=48000000L
adafruit_hallowing.build.usb_product="Hallowing M0"
adafruit_hallowing.build.usb_manufacturer="Adafruit"
adafruit_hallowing.build.board=SAMD_HALLOWING
adafruit_hallowing.build.core=arduino
adafruit_hallowing.build.extra_flags=-D__SAMD21G18A__ -DCRYSTALLESS -DARDUINO_SAMD_HALLOWING_M0 -DADAFRUIT_HALLOWING -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_hallowing.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_hallowing.build.variant=hallowing_m0_express
adafruit_hallowing.build.variant_system_lib=
adafruit_hallowing.build.vid=0x239A
adafruit_hallowing.build.pid=0xDEAD
adafruit_hallowing.bootloader.tool=openocd
adafruit_hallowing.bootloader.file=hallowingM0/bootloader-hallowing_m0-v2.0.0-adafruit.0-21-g887cc30.bin

# Menu: Optimization
adafruit_hallowing.menu.opt.small=Small (-Os) (standard)
adafruit_hallowing.menu.opt.small.build.flags.optimize=-Os
adafruit_hallowing.menu.opt.fast=Fast (-O2)
adafruit_hallowing.menu.opt.fast.build.flags.optimize=-O2
adafruit_hallowing.menu.opt.faster=Faster (-O3)
adafruit_hallowing.menu.opt.faster.build.flags.optimize=-O3
adafruit_hallowing.menu.opt.fastest=Fastest (-Ofast)
adafruit_hallowing.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_hallowing.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_hallowing.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

# Menu: USB Stack
adafruit_hallowing.menu.usbstack.arduino=Arduino
adafruit_hallowing.menu.usbstack.tinyusb=TinyUSB
adafruit_hallowing.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
adafruit_hallowing.menu.debug.off=Off
adafruit_hallowing.menu.debug.on=On
adafruit_hallowing.menu.debug.on.build.flags.debug=-g

# Menu: Debugger
adafruit_hallowing.menu.debugger.daplink=CMSIS-DAP (DAPLink)
adafruit_hallowing.menu.debugger.daplink.build.openocdscript=scripts/openocd/daplink_samd21.cfg
adafruit_hallowing.menu.debugger.jlink=J-Link
adafruit_hallowing.menu.debugger.jlink.build.openocdscript=scripts/openocd/jlink_samd21.cfg

# -----------------------------------
# Adafruit Crickit M0 (SAMD21)
# -----------------------------------
adafruit_crickit_m0.name=Adafruit Crickit M0 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_crickit_m0.vid.0=0x239A
adafruit_crickit_m0.pid.0=0x802D
adafruit_crickit_m0.vid.1=0x239A
adafruit_crickit_m0.pid.1=0x002D
adafruit_crickit_m0.vid.2=0x239A
adafruit_crickit_m0.pid.2=0x802D

# Upload
adafruit_crickit_m0.upload.tool=bossac18
adafruit_crickit_m0.upload.protocol=sam-ba
adafruit_crickit_m0.upload.maximum_size=262144
adafruit_crickit_m0.upload.offset=0x2000
adafruit_crickit_m0.upload.use_1200bps_touch=true
adafruit_crickit_m0.upload.wait_for_upload_port=true
adafruit_crickit_m0.upload.native_usb=true

# Build
adafruit_crickit_m0.build.mcu=cortex-m0plus
adafruit_crickit_m0.build.f_cpu=48000000L
adafruit_crickit_m0.build.usb_product="Crickit M0"
adafruit_crickit_m0.build.usb_manufacturer="Adafruit"
adafruit_crickit_m0.build.board=CRICKIT_M0
adafruit_crickit_m0.build.core=arduino
adafruit_crickit_m0.build.extra_flags=-D__SAMD21G18A__ -DCRYSTALLESS -DADAFRUIT_CRICKIT_M0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_crickit_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_crickit_m0.build.variant=crickit_m0
adafruit_crickit_m0.build.variant_system_lib=
adafruit_crickit_m0.build.vid=0x239A
adafruit_crickit_m0.build.pid=0x802D
adafruit_crickit_m0.bootloader.tool=openocd
adafruit_crickit_m0.bootloader.file=crickit/samd21_sam_ba.bin

# Menu: Optimization
adafruit_crickit_m0.menu.opt.small=Small (-Os) (standard)
adafruit_crickit_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_crickit_m0.menu.opt.fast=Fast (-O2)
adafruit_crickit_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_crickit_m0.menu.opt.faster=Faster (-O3)
adafruit_crickit_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_crickit_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_crickit_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_crickit_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_crickit_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

