trapped-dot-com/ArduinoCore-samd/boards.txt
# Menu: USB Stack
adafruit_crickit_m0.menu.usbstack.arduino=Arduino
adafruit_crickit_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_crickit_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
adafruit_crickit_m0.menu.debug.off=Off
adafruit_crickit_m0.menu.debug.on=On
adafruit_crickit_m0.menu.debug.on.build.flags.debug=-g

# Menu: Debugger
adafruit_crickit_m0.menu.debugger.daplink=CMSIS-DAP (DAPLink)
adafruit_crickit_m0.menu.debugger.daplink.build.openocdscript=scripts/openocd/daplink_samd21.cfg
adafruit_crickit_m0.menu.debugger.jlink=J-Link
adafruit_crickit_m0.menu.debugger.jlink.build.openocdscript=scripts/openocd/jlink_samd21.cfg

# -----------------------------------
# Adafruit BLM Badge (SAMD21)
# -----------------------------------
adafruit_blm_badge.name=Adafruit BLM Badge (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_blm_badge.vid.0=0x239A
adafruit_blm_badge.pid.0=0x80BF
adafruit_blm_badge.vid.1=0x239A
adafruit_blm_badge.pid.1=0x00BF
adafruit_blm_badge.vid.2=0x239A
adafruit_blm_badge.pid.2=0x80C0

# Upload
adafruit_blm_badge.upload.tool=bossac18
adafruit_blm_badge.upload.protocol=sam-ba
adafruit_blm_badge.upload.maximum_size=262144
adafruit_blm_badge.upload.offset=0x2000
adafruit_blm_badge.upload.use_1200bps_touch=true
adafruit_blm_badge.upload.wait_for_upload_port=true
adafruit_blm_badge.upload.native_usb=true

# Build
adafruit_blm_badge.build.mcu=cortex-m0plus
adafruit_blm_badge.build.f_cpu=48000000L
adafruit_blm_badge.build.usb_product="BLM Badge"
adafruit_blm_badge.build.usb_manufacturer="Adafruit"
adafruit_blm_badge.build.board=BLM_BADGE_M0
adafruit_blm_badge.build.core=arduino
adafruit_blm_badge.build.extra_flags=-D__SAMD21E18A__ -DCRYSTALLESS -DADAFRUIT_BLM_BADGE -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_blm_badge.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_blm_badge.build.variant=blm_badge
adafruit_blm_badge.build.variant_system_lib=
adafruit_blm_badge.build.vid=0x239A
adafruit_blm_badge.build.pid=0x80BF
adafruit_blm_badge.bootloader.tool=openocd
adafruit_blm_badge.bootloader.file=blmbadge/bootloader-blm_badge.bin

# Menu: Optimization
adafruit_blm_badge.menu.opt.small=Small (-Os) (standard)
adafruit_blm_badge.menu.opt.small.build.flags.optimize=-Os
adafruit_blm_badge.menu.opt.fast=Fast (-O2)
adafruit_blm_badge.menu.opt.fast.build.flags.optimize=-O2
adafruit_blm_badge.menu.opt.faster=Faster (-O3)
adafruit_blm_badge.menu.opt.faster.build.flags.optimize=-O3
adafruit_blm_badge.menu.opt.fastest=Fastest (-Ofast)
adafruit_blm_badge.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_blm_badge.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_blm_badge.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

# Menu: USB Stack
adafruit_blm_badge.menu.usbstack.arduino=Arduino
adafruit_blm_badge.menu.usbstack.tinyusb=TinyUSB
adafruit_blm_badge.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
adafruit_blm_badge.menu.debug.off=Off
adafruit_blm_badge.menu.debug.on=On
adafruit_blm_badge.menu.debug.on.build.flags.debug=-g

# Menu: Debugger
adafruit_blm_badge.menu.debugger.daplink=CMSIS-DAP (DAPLink)
adafruit_blm_badge.menu.debugger.daplink.build.openocdscript=scripts/openocd/daplink_samd21.cfg
adafruit_blm_badge.menu.debugger.jlink=J-Link
adafruit_blm_badge.menu.debugger.jlink.build.openocdscript=scripts/openocd/jlink_samd21.cfg

# -----------------------------------
# Adafruit Metro M4 (SAMD51)
# -----------------------------------
adafruit_metro_m4.name=Adafruit Metro M4 (SAMD51)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_metro_m4.vid.0=0x239A
adafruit_metro_m4.pid.0=0x8020
adafruit_metro_m4.vid.1=0x239A
adafruit_metro_m4.pid.1=0x0020
adafruit_metro_m4.vid.2=0x239A
adafruit_metro_m4.pid.2=0x8021
adafruit_metro_m4.vid.3=0x239A
adafruit_metro_m4.pid.3=0x0021

# Upload
adafruit_metro_m4.upload.tool=bossac18
adafruit_metro_m4.upload.protocol=sam-ba
adafruit_metro_m4.upload.maximum_size=507904
adafruit_metro_m4.upload.offset=0x4000
adafruit_metro_m4.upload.use_1200bps_touch=true
adafruit_metro_m4.upload.wait_for_upload_port=true
adafruit_metro_m4.upload.native_usb=true

# Build
adafruit_metro_m4.build.mcu=cortex-m4
adafruit_metro_m4.build.f_cpu=120000000L
adafruit_metro_m4.build.usb_product="Metro M4"
adafruit_metro_m4.build.usb_manufacturer="Adafruit"
adafruit_metro_m4.build.board=METRO_M4
adafruit_metro_m4.build.core=arduino
adafruit_metro_m4.build.extra_flags=-D__SAMD51J19A__ -DADAFRUIT_METRO_M4_EXPRESS -D__SAMD51__ -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 {build.usb_flags}
adafruit_metro_m4.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_metro_m4.build.variant=metro_m4
adafruit_metro_m4.build.variant_system_lib=
adafruit_metro_m4.build.vid=0x239A
adafruit_metro_m4.build.pid=0x8020
adafruit_metro_m4.bootloader.tool=openocd
adafruit_metro_m4.bootloader.file=metroM4/bootloader-metro_m4-v2.0.0-adafruit.5.bin
adafruit_metro_m4.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

# Menu: Cache
adafruit_metro_m4.menu.cache.on=Enabled
adafruit_metro_m4.menu.cache.on.build.cache_flags=-DENABLE_CACHE
adafruit_metro_m4.menu.cache.off=Disabled
adafruit_metro_m4.menu.cache.off.build.cache_flags=

# Menu: Speed
adafruit_metro_m4.menu.speed.120=120 MHz (standard)
adafruit_metro_m4.menu.speed.120.build.f_cpu=120000000L
adafruit_metro_m4.menu.speed.150=150 MHz (overclock)
adafruit_metro_m4.menu.speed.150.build.f_cpu=150000000L
adafruit_metro_m4.menu.speed.180=180 MHz (overclock)
adafruit_metro_m4.menu.speed.180.build.f_cpu=180000000L
adafruit_metro_m4.menu.speed.200=200 MHz (overclock)
adafruit_metro_m4.menu.speed.200.build.f_cpu=200000000L

# Menu: Optimization
adafruit_metro_m4.menu.opt.small=Small (-Os) (standard)
adafruit_metro_m4.menu.opt.small.build.flags.optimize=-Os
adafruit_metro_m4.menu.opt.fast=Fast (-O2)
adafruit_metro_m4.menu.opt.fast.build.flags.optimize=-O2
adafruit_metro_m4.menu.opt.faster=Faster (-O3)
adafruit_metro_m4.menu.opt.faster.build.flags.optimize=-O3
adafruit_metro_m4.menu.opt.fastest=Fastest (-Ofast)
adafruit_metro_m4.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_metro_m4.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_metro_m4.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

# Menu: QSPI Speed
adafruit_metro_m4.menu.maxqspi.50=50 MHz (standard)
adafruit_metro_m4.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
adafruit_metro_m4.menu.maxqspi.fcpu=CPU Speed / 2
adafruit_metro_m4.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})

